results/linux/fileio_high.txt
Running 1m test @ http://localhost:3000/fileio
  8 threads and 500 connections
  Thread calibration: mean lat.: 0.898ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.904ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.898ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.897ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.896ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.393ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.893ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.890ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.98ms  698.57us  37.79ms   85.85%
    Req/Sec     1.31k     0.91k    6.89k    87.81%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93ms
 75.000%    1.25ms
 90.000%    1.58ms
 99.000%    2.65ms
 99.900%    5.85ms
 99.990%   27.53ms
 99.999%   36.03ms
100.000%   37.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.082     0.000000            2         1.00
       0.348     0.100000        49706         1.11
       0.515     0.200000        99514         1.25
       0.662     0.300000       149228         1.43
       0.801     0.400000       199046         1.67
       0.934     0.500000       248693         2.00
       0.998     0.550000       273342         2.22
       1.062     0.600000       298370         2.50
       1.124     0.650000       323179         2.86
       1.186     0.700000       347891         3.33
       1.253     0.750000       373022         4.00
       1.289     0.775000       385372         4.44
       1.330     0.800000       397767         5.00
       1.377     0.825000       410169         5.71
       1.432     0.850000       422397         6.67
       1.500     0.875000       434914         8.00
       1.540     0.887500       441113         8.89
       1.584     0.900000       447298        10.00
       1.633     0.912500       453455        11.43
       1.690     0.925000       459684        13.33
       1.760     0.937500       465863        16.00
       1.802     0.943750       468968        17.78
       1.848     0.950000       472074        20.00
       1.903     0.956250       475171        22.86
       1.969     0.962500       478297        26.67
       2.057     0.968750       481445        32.00
       2.111     0.971875       482991        35.56
       2.173     0.975000       484510        40.00
       2.243     0.978125       486058        45.71
       2.321     0.981250       487613        53.33
       2.417     0.984375       489145        64.00
       2.473     0.985938       489931        71.11
       2.537     0.987500       490711        80.00
       2.605     0.989062       491475        91.43
       2.689     0.990625       492260       106.67
       2.801     0.992188       493036       128.00
       2.873     0.992969       493418       142.22
       2.969     0.993750       493805       160.00
       3.093     0.994531       494199       182.86
       3.257     0.995313       494580       213.33
       3.497     0.996094       494970       256.00
       3.685     0.996484       495163       284.44
       3.869     0.996875       495357       320.00
       4.085     0.997266       495552       365.71
       4.339     0.997656       495745       426.67
       4.671     0.998047       495940       512.00
       4.839     0.998242       496038       568.89
       5.063     0.998437       496135       640.00
       5.255     0.998633       496231       731.43
       5.575     0.998828       496328       853.33
       5.883     0.999023       496424      1024.00
       6.171     0.999121       496473      1137.78
       6.675     0.999219       496521      1280.00
       7.939     0.999316       496570      1462.86
       9.407     0.999414       496618      1706.67
      11.247     0.999512       496667      2048.00
      11.783     0.999561       496691      2275.56
      12.447     0.999609       496715      2560.00
      13.439     0.999658       496740      2925.71
      14.663     0.999707       496764      3413.33
      15.703     0.999756       496788      4096.00
      16.007     0.999780       496800      4551.11
      16.767     0.999805       496812      5120.00
      18.159     0.999829       496825      5851.43
      20.607     0.999854       496837      6826.67
      23.983     0.999878       496849      8192.00
      27.247     0.999890       496855      9102.22
      27.679     0.999902       496861     10240.00
      27.919     0.999915       496867     11702.86
      28.239     0.999927       496873     13653.33
      31.359     0.999939       496879     16384.00
      31.727     0.999945       496882     18204.44
      32.127     0.999951       496885     20480.00
      33.503     0.999957       496888     23405.71
      33.919     0.999963       496891     27306.67
      34.335     0.999969       496894     32768.00
      34.655     0.999973       496896     36408.89
      34.879     0.999976       496897     40960.00
      35.455     0.999979       496899     46811.43
      35.679     0.999982       496900     54613.33
      35.807     0.999985       496902     65536.00
      35.935     0.999986       496903     72817.78
      35.935     0.999988       496903     81920.00
      36.031     0.999989       496904     93622.86
      36.159     0.999991       496905    109226.67
      36.543     0.999992       496906    131072.00
      36.543     0.999993       496906    145635.56
      36.543     0.999994       496906    163840.00
      36.927     0.999995       496907    187245.71
      36.927     0.999995       496907    218453.33
      37.567     0.999996       496908    262144.00
      37.567     0.999997       496908    291271.11
      37.567     0.999997       496908    327680.00
      37.567     0.999997       496908    374491.43
      37.567     0.999998       496908    436906.67
      37.823     0.999998       496909    524288.00
      37.823     1.000000       496909          inf
#[Mean    =        0.982, StdDeviation   =        0.699]
#[Max     =       37.792, Total count    =       496909]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597664 requests in 1.00m, 76.95MB read
  Non-2xx or 3xx responses: 4
Requests/sec:   9956.96
Transfer/sec:      1.28MB