results/linux/fileio_mid.txt
Running 1m test @ http://localhost:3000/fileio
  8 threads and 200 connections
  Thread calibration: mean lat.: 0.897ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.899ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.881ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.888ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.887ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.887ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.883ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.889ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.87ms  482.77us  10.10ms   72.95%
    Req/Sec   667.71     97.56     1.44k    69.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.85ms
 75.000%    1.15ms
 90.000%    1.40ms
 99.000%    1.99ms
 99.900%    5.09ms
 99.990%    8.73ms
 99.999%    9.66ms
100.000%   10.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.078     0.000000            3         1.00
       0.303     0.100000        25003         1.11
       0.465     0.200000        50021         1.25
       0.608     0.300000        74912         1.43
       0.735     0.400000        99898         1.67
       0.852     0.500000       124755         2.00
       0.910     0.550000       137243         2.22
       0.969     0.600000       149823         2.50
       1.028     0.650000       162269         2.86
       1.088     0.700000       174723         3.33
       1.146     0.750000       187103         4.00
       1.176     0.775000       193403         4.44
       1.208     0.800000       199592         5.00
       1.243     0.825000       205793         5.71
       1.285     0.850000       211996         6.67
       1.338     0.875000       218275         8.00
       1.369     0.887500       221326         8.89
       1.404     0.900000       224487        10.00
       1.441     0.912500       227596        11.43
       1.481     0.925000       230674        13.33
       1.528     0.937500       233814        16.00
       1.554     0.943750       235400        17.78
       1.582     0.950000       236900        20.00
       1.612     0.956250       238481        22.86
       1.648     0.962500       240061        26.67
       1.690     0.968750       241579        32.00
       1.715     0.971875       242362        35.56
       1.744     0.975000       243142        40.00
       1.776     0.978125       243914        45.71
       1.816     0.981250       244694        53.33
       1.867     0.984375       245488        64.00
       1.893     0.985938       245871        71.11
       1.927     0.987500       246256        80.00
       1.963     0.989062       246653        91.43
       2.012     0.990625       247034       106.67
       2.081     0.992188       247422       128.00
       2.153     0.992969       247620       142.22
       2.277     0.993750       247811       160.00
       2.467     0.994531       248007       182.86
       2.705     0.995313       248201       213.33
       2.979     0.996094       248394       256.00
       3.107     0.996484       248492       284.44
       3.267     0.996875       248589       320.00
       3.455     0.997266       248687       365.71
       3.643     0.997656       248785       426.67
       3.917     0.998047       248881       512.00
       4.099     0.998242       248930       568.89
       4.355     0.998437       248979       640.00
       4.575     0.998633       249028       731.43
       4.823     0.998828       249076       853.33
       5.103     0.999023       249126      1024.00
       5.251     0.999121       249149      1137.78
       5.455     0.999219       249174      1280.00
       5.727     0.999316       249199      1462.86
       6.007     0.999414       249222      1706.67
       6.291     0.999512       249247      2048.00
       6.459     0.999561       249260      2275.56
       6.699     0.999609       249271      2560.00
       7.019     0.999658       249283      2925.71
       7.319     0.999707       249295      3413.33
       7.835     0.999756       249308      4096.00
       7.891     0.999780       249314      4551.11
       7.983     0.999805       249320      5120.00
       8.119     0.999829       249326      5851.43
       8.255     0.999854       249332      6826.67
       8.527     0.999878       249338      8192.00
       8.631     0.999890       249341      9102.22
       8.751     0.999902       249344     10240.00
       8.951     0.999915       249347     11702.86
       8.975     0.999927       249350     13653.33
       9.143     0.999939       249353     16384.00
       9.223     0.999945       249355     18204.44
       9.231     0.999951       249356     20480.00
       9.287     0.999957       249358     23405.71
       9.303     0.999963       249359     27306.67
       9.383     0.999969       249362     32768.00
       9.383     0.999973       249362     36408.89
       9.383     0.999976       249362     40960.00
       9.399     0.999979       249363     46811.43
       9.471     0.999982       249364     54613.33
       9.631     0.999985       249365     65536.00
       9.631     0.999986       249365     72817.78
       9.631     0.999988       249365     81920.00
       9.663     0.999989       249366     93622.86
       9.663     0.999991       249366    109226.67
       9.879     0.999992       249367    131072.00
       9.879     0.999993       249367    145635.56
       9.879     0.999994       249367    163840.00
       9.879     0.999995       249367    187245.71
       9.879     0.999995       249367    218453.33
      10.111     0.999996       249368    262144.00
      10.111     1.000000       249368          inf
#[Mean    =        0.873, StdDeviation   =        0.483]
#[Max     =       10.104, Total count    =       249368]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299793 requests in 1.00m, 38.60MB read
  Non-2xx or 3xx responses: 5
Requests/sec:   4996.36
Transfer/sec:    658.71KB